[
    {
        "title": "My introduction",
        "cover": "noteCovers/omoriCover.gif",
        "date" : "June 4, 2024",
        "synopsis": "a small blog about who I am and what I do",
        "article": "Welcome to my notes. \nMy name is Orion Chen, a second-year student in Computer Science that is trying to beat the tech unemployment wave in the near future. My current goals are to learn a variety of technologies that can build concrete projects like this. \n\nThe languages I've worked with include: {Python,Java,C,Javascript,HTML/CSS}You can see some things I worked on in the WORK tab. Other tools I have experience with include Git and Postman. I've experimented with a bunch of things, but until I'm fluent, I cannot confidently add them to the list. Writing notes probably never make it though.\n\nSee you later."
    },
    {
        "title": "This website",
        "cover": "images/OMORI_2.png",
        "date" : "June 8, 2024",
        "synopsis": "a talk about the development of this website",
        "article": "After months of procrastinating and hours of searching how to center a div, this website is finally finished. I used React and vanilla CSS to create this design. My motive to create this portfolio was to give my previous one (which was really bad) a better aesthetic and minimalistic look. Design is one of the most important elements of software creation and is often a challenge to my creativity; thus, I usually hop on <https://www.awwwards.com/websites/sites_of_the_day|awwwards.com> to get some inspiration from professional studios. As much as I admire the art on there, front-end programming is a different type of debugging hell, so I'll stick to my basic divs and imgs. However, I think the website looks pretty fine for the most part. I spent a lot of time choosing colour schemes, page layout, font families, and more. My favourite page to make was the WORK tab, where I was proud of coming up with that layout. The WORK tab was actually redesigned into what it is now because over time I realized how ugly it looked in its early stages. Oh yeah, responsive design is also implemented so you can view this on your phone without it becoming a total mess. Anyway, this project was a fun learning experience. \n\nEverybody wanted to know what I would do if I [didn't finish this website].\n I guess we'll never know."
    },
    {
        "title": "BLOG 3",
        "cover": "images/OMORI_3.png",
        "date" : "March 16 2005",
        "synopsis": "someone special",
        "article": "{<http://localhost:3000/notes>, special}"
    },
    {
        "title": "BLOG 4",
        "cover": "images/OMORI_4.png",
        "date" : "Decemeber 16 2005",
        "synopsis": "RAAAAAAAAAAAAHHH"
    },
    {
        "title": "BLOG 4",
        "cover": "images/OMORI_4.png",
        "date" : "Decemeber 16 2005",
        "synopsis": "someone"
    },
    {
        "title": "BLOG 4",
        "cover": "images/OMORI_4.png",
        "date" : "Decemeber 16 2005",
        "synopsis": "someone"
    },
    {
        "title": "BLOG 4",
        "cover": "images/OMORI_4.png",
        "date" : "Decemeber 16 2005",
        "synopsis": "someone"
    }
]